import style from './Header.module.css';
import { Auth } from './Auth/Auth';
import { Layout } from '../../Layouts/Layout/Layout';
<<<<<<< HEAD
import { ReactComponent as BurgerSvg } from './img/burger_menu.svg';
import { ReactComponent as Notification } from './img/notification.svg';
import { ReactComponent as Collection } from './img/collection.svg';
import { ReactComponent as Chat } from './img/chat.svg';
import { useState } from 'react';

export const Header = () => {
  const [isOpen, setIsOpen] = useState(false);
=======
import { Search } from '../Search/Search';
import { useLocation, useParams } from 'react-router-dom';

export const Header = () => {
  const location = useLocation();
  const { id } = useParams();
>>>>>>> 7b123ef08944d603adc269b322c9dc2a6df63b4a

  return (
    <header className={style.header} id='header'>
      <Layout>
        <div className={style.header__wrapper}>
          <div>
<<<<<<< HEAD
            <h1 className={style.title}>КУДА СХОДИТЬ?</h1>
            <p className={style.subtitle}>отдых, который подойдет именно Вам</p>
            <div className={style.search}>
              <span className={style.city}>Краснодар</span>
            </div>
          </div>
          <div className={style.header__wrapper}>
            <Auth />
            {
              isOpen && (
                <div className={style.header__burger_menu} >
                    <Collection className={style.header__burger_svg} />
                    <Chat className={style.header__burger_svg} />
                    <Notification className={style.header__burger_svg} />
                </div>
              )
            }
            <BurgerSvg className={style.header__burger} onClick={() => setIsOpen(!isOpen)} />
          </div>
=======
            {location.pathname === '/' && (
              <>
                <h1 className={style.title}>КУДА СХОДИТЬ?</h1>
                <p className={style.subtitle}>
                  отдых, который подойдет именно Вам
                </p>
                <span className={style.city}>Краснодар</span>
              </>
            )}

            {location.pathname === '/events' && (
              <>
                <p className={style.events}>Топ событий этой недели</p>
                <p className={style.subtitleEvents}>
                  все значимые события города и края
                </p>
              </>
            )}

            {location.pathname === `/events/${id}` && (
              <>
                <p className={style.events}>Cобытие</p>
                <p className={style.subtitleEvents}>
                  место, куда вам захочется вернуться :)
                </p>
              </>
            )}

            {location.pathname === `/locations/${id}` && (
              <>
                <p className={style.events}>лОКация</p>
                <p className={style.subtitleEvents}>
                  место, куда вам захочется вернуться :)
                </p>
              </>
            )}

            <Search />
          </div>
          <div className={style.iconWrapper}>
            <svg
              width='48'
              height='48'
              viewBox='0 0 48 48'
              fill='none'
              xmlns='http://www.w3.org/2000/svg'
            >
              <path
                d='M12.8445 34.5H37.5015C38.3455 34.469 39.0485 34.172 39.6105 33.609C40.1725 33.046 40.4695 32.343 40.5015 31.5V12C40.4705 11.156 40.1735 10.453 39.6105 9.891C39.0475 9.329 38.3445 9.032 37.5015 9H10.5015C9.6575 9.031 8.9545 9.328 8.3925 9.891C7.8305 10.454 7.5335 11.157 7.5015 12V38.766L12.8445 34.5ZM13.875 37.5L6.9375 43.032C6.4375 43.407 5.914 43.4615 5.367 43.1955C4.82 42.9295 4.531 42.484 4.5 41.859V12C4.531 10.312 5.117 8.898 6.258 7.758C7.399 6.618 8.813 6.032 10.5 6H37.5C39.188 6.031 40.602 6.617 41.742 7.758C42.882 8.899 43.468 10.313 43.5 12V31.5C43.469 33.188 42.883 34.602 41.742 35.742C40.601 36.882 39.187 37.468 37.5 37.5H13.875ZM24 23.391C23.312 23.391 22.7415 23.1645 22.2885 22.7115C21.8355 22.2585 21.609 21.688 21.609 21C21.609 20.312 21.8355 19.7415 22.2885 19.2885C22.7415 18.8355 23.312 18.609 24 18.609C24.688 18.609 25.2585 18.8355 25.7115 19.2885C26.1645 19.7415 26.391 20.312 26.391 21C26.391 21.688 26.1645 22.2585 25.7115 22.7115C25.2585 23.1645 24.688 23.391 24 23.391ZM33 23.391C32.312 23.391 31.7415 23.1645 31.2885 22.7115C30.8355 22.2585 30.609 21.688 30.609 21C30.609 20.312 30.8355 19.7415 31.2885 19.2885C31.7415 18.8355 32.312 18.609 33 18.609C33.688 18.609 34.2585 18.8355 34.7115 19.2885C35.1645 19.7415 35.391 20.312 35.391 21C35.391 21.688 35.1645 22.2585 34.7115 22.7115C34.2585 23.1645 33.688 23.391 33 23.391ZM15 23.391C14.312 23.391 13.7415 23.1645 13.2885 22.7115C12.8355 22.2585 12.609 21.688 12.609 21C12.609 20.312 12.8355 19.7415 13.2885 19.2885C13.7415 18.8355 14.312 18.609 15 18.609C15.688 18.609 16.2585 18.8355 16.7115 19.2885C17.1645 19.7415 17.391 20.312 17.391 21C17.391 21.688 17.1645 22.2585 16.7115 22.7115C16.2585 23.1645 15.688 23.391 15 23.391Z'
                fill='#08080A'
                fillOpacity='0.96'
              />
            </svg>

            <svg
              width='48'
              height='48'
              viewBox='0 0 48 48'
              fill='none'
              xmlns='http://www.w3.org/2000/svg'
            >
              <path
                d='M12 6V38.766L21.1875 31.407C22.0315 30.751 22.969 30.423 24 30.423C25.031 30.423 25.9685 30.751 26.8125 31.407L36 38.766V6H12ZM10.5 3H37.5C37.938 3 38.2975 3.1405 38.5785 3.4215C38.8595 3.7025 39 4.062 39 4.5V41.859C38.969 42.484 38.68 42.9295 38.133 43.1955C37.586 43.4615 37.0625 43.407 36.5625 43.032L24.9375 33.75C24.6565 33.531 24.344 33.4215 24 33.4215C23.656 33.4215 23.3435 33.531 23.0625 33.75L11.4375 43.032C10.9375 43.407 10.414 43.4615 9.867 43.1955C9.32 42.9295 9.031 42.484 9 41.859V4.5C9 4.062 9.1405 3.7025 9.4215 3.4215C9.7025 3.1405 10.062 3 10.5 3Z'
                fill='black'
              />
            </svg>

            <svg
              width='48'
              height='48'
              viewBox='0 0 48 48'
              fill='none'
              xmlns='http://www.w3.org/2000/svg'
            >
              <path
                d='M20 42H28C28 43.0609 27.5786 44.0783 26.8284 44.8284C26.0783 45.5786 25.0609 46 24 46C22.9391 46 21.9217 45.5786 21.1716 44.8284C20.4214 44.0783 20 43.0609 20 42ZM6.15199 36.766C6.00058 36.4005 5.961 35.9982 6.03825 35.6102C6.1155 35.2221 6.30612 34.8657 6.58599 34.586L9.99999 31.172V20C10.0064 16.637 11.2222 13.3885 13.4253 10.8476C15.6284 8.30668 18.6718 6.64289 22 6.16V4C22 3.46957 22.2107 2.96086 22.5858 2.58579C22.9608 2.21071 23.4696 2 24 2C24.5304 2 25.0391 2.21071 25.4142 2.58579C25.7893 2.96086 26 3.46957 26 4V6.16C29.3281 6.64289 32.3716 8.30668 34.5747 10.8476C36.7778 13.3885 37.9936 16.637 38 20V31.172L41.414 34.586C41.6936 34.8657 41.884 35.222 41.9612 35.6099C42.0383 35.9978 41.9987 36.3999 41.8473 36.7653C41.696 37.1307 41.4397 37.443 41.1109 37.6628C40.7821 37.8826 40.3955 37.9999 40 38H7.99999C7.60446 38.0001 7.21778 37.8829 6.88884 37.6633C6.5599 37.4436 6.30348 37.1314 6.15199 36.766ZM12.828 34H35.172L34.586 33.414C34.2109 33.039 34.0001 32.5304 34 32V20C34 17.3478 32.9464 14.8043 31.0711 12.9289C29.1957 11.0536 26.6522 10 24 10C21.3478 10 18.8043 11.0536 16.9289 12.9289C15.0536 14.8043 14 17.3478 14 20V32C13.9999 32.5304 13.7891 33.039 13.414 33.414L12.828 34Z'
                fill='black'
              />
            </svg>

            <svg
              width='48'
              height='48'
              viewBox='0 0 48 48'
              fill='none'
              xmlns='http://www.w3.org/2000/svg'
            >
              <path
                d='M4 8C4 7.46957 4.21071 6.96086 4.58579 6.58579C4.96086 6.21071 5.46957 6 6 6H42C42.5304 6 43.0391 6.21071 43.4142 6.58579C43.7893 6.96086 44 7.46957 44 8C44 8.53043 43.7893 9.03914 43.4142 9.41421C43.0391 9.78929 42.5304 10 42 10H6C5.46957 10 4.96086 9.78929 4.58579 9.41421C4.21071 9.03914 4 8.53043 4 8ZM6 26H42C42.5304 26 43.0391 25.7893 43.4142 25.4142C43.7893 25.0391 44 24.5304 44 24C44 23.4696 43.7893 22.9609 43.4142 22.5858C43.0391 22.2107 42.5304 22 42 22H6C5.46957 22 4.96086 22.2107 4.58579 22.5858C4.21071 22.9609 4 23.4696 4 24C4 24.5304 4.21071 25.0391 4.58579 25.4142C4.96086 25.7893 5.46957 26 6 26ZM6 42H42C42.5304 42 43.0391 41.7893 43.4142 41.4142C43.7893 41.0391 44 40.5304 44 40C44 39.4696 43.7893 38.9609 43.4142 38.5858C43.0391 38.2107 42.5304 38 42 38H6C5.46957 38 4.96086 38.2107 4.58579 38.5858C4.21071 38.9609 4 39.4696 4 40C4 40.5304 4.21071 41.0391 4.58579 41.4142C4.96086 41.7893 5.46957 42 6 42Z'
                fill='black'
              />
            </svg>

            <Auth />
          </div>
>>>>>>> 7b123ef08944d603adc269b322c9dc2a6df63b4a
        </div>
      </Layout>
    </header>
  );
};
